# Introduction to Pandas

Pandas is a library providing high-performance, easy-to-use data structures and data analysis tools. 7

The core of pandas is its *dataframe* which is essentially a table of data. 

Pandas provides easy and powerful ways to import data from a variety of sources and export it to just as many. 

It is also explicitly designed to handle *missing data* elegantly which is a very common problem in data from the real world.

The offical [pandas documentation](http://pandas.pydata.org/pandas-docs/stable/) is very comprehensive and you will be answer a lot of questions in there, however, it can sometimes be hard to find the right page. Don't be afraid to use Google to find help.

### What Can Pandas Do?

Pandas gives you answers about the data. Like:

    Is there a correlation between two or more columns?
    What is average value?
    Max value?
    Min value?
    Filter data

Pandas has a standard convention for importing it which you will see used in a lot of documentation so we will follow that in this course:

In [4]:
import pandas as pd
from pandas import Series, DataFrame

## DataFrame

Pandas' `DataFrame` is a two (or possibly more) dimensional table of data.

In [5]:
data = {'city': ['Paris', 'Paris', 'Paris', 'Paris',
                 'London', 'London', 'London', 'London',
                 'Rome', 'Rome', 'Rome', 'Rome'],
        'year': [2001, 2008, 2009, 2010,
                 2001, 2006, 2011, 2015,
                 2001, 2006, 2009, 2012],
        'pop': [2.148, 2.211, 2.234, 2.244,
                7.322, 7.657, 8.174, 8.615,
                2.547, 2.627, 2.734, 2.627]}

In [6]:
data

{'city': ['Paris',
  'Paris',
  'Paris',
  'Paris',
  'London',
  'London',
  'London',
  'London',
  'Rome',
  'Rome',
  'Rome',
  'Rome'],
 'year': [2001,
  2008,
  2009,
  2010,
  2001,
  2006,
  2011,
  2015,
  2001,
  2006,
  2009,
  2012],
 'pop': [2.148,
  2.211,
  2.234,
  2.244,
  7.322,
  7.657,
  8.174,
  8.615,
  2.547,
  2.627,
  2.734,
  2.627]}

In [7]:
df = DataFrame(data)

This has created a `DataFrame` from the dictionary `data`. The keys will become the column headers and the values will be the values in each column. An index will be created automatically.

In [8]:
df

      city  year    pop
0    Paris  2001  2.148
1    Paris  2008  2.211
2    Paris  2009  2.234
3    Paris  2010  2.244
4   London  2001  7.322
5   London  2006  7.657
6   London  2011  8.174
7   London  2015  8.615
8     Rome  2001  2.547
9     Rome  2006  2.627
10    Rome  2009  2.734
11    Rome  2012  2.627

Or, if you just want a peek at the data, you can just grab the first few rows with:

In [10]:
df.head(4)

    city  year    pop
0  Paris  2001  2.148
1  Paris  2008  2.211
2  Paris  2009  2.234
3  Paris  2010  2.244

In [12]:
df.tail(1)

    city  year    pop
11  Rome  2012  2.627

In [13]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   city    12 non-null     object
 1   year    12 non-null     int64
 2   pop     12 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 416.0+ bytes
None

Since we passed in a dictionary to the `DataFrame` constructor, the order of the columns will not necessarilly match the order in which you defined them. To enforce a certain order, you can pass a `columns` argument to the constructor giving a list of the columns in the order you want them:

In [14]:
DataFrame(data, columns=['year', 'city', 'pop'])

    year    city    pop
0   2001   Paris  2.148
1   2008   Paris  2.211
2   2009   Paris  2.234
3   2010   Paris  2.244
4   2001  London  7.322
5   2006  London  7.657
6   2011  London  8.174
7   2015  London  8.615
8   2001    Rome  2.547
9   2006    Rome  2.627
10  2009    Rome  2.734
11  2012    Rome  2.627

## exploring a dataframe

You can access any column directly by using square brackets or by named attributes:

In [15]:
df['year']

0     2001
1     2008
2     2009
3     2010
4     2001
5     2006
6     2011
7     2015
8     2001
9     2006
10    2009
11    2012
Name: year, dtype: int64

In [16]:
df.year

0     2001
1     2008
2     2009
3     2010
4     2001
5     2006
6     2011
7     2015
8     2001
9     2006
10    2009
11    2012
Name: year, dtype: int64

In [17]:
type(df.city)

pandas.core.series.Series

In [18]:
df.head()

     city  year    pop
0   Paris  2001  2.148
1   Paris  2008  2.211
2   Paris  2009  2.234
3   Paris  2010  2.244
4  London  2001  7.322

If you want to select a **row** from a `DataFrame` then you can use the `.loc` attribute which allows you to pass index values like:

In [20]:
df.loc[0]

city    Paris
year     2001
pop     2.148
Name: 0, dtype: object

In [21]:
df.loc[2, 'city']

'Paris'

In [16]:
df.loc[2][0]

'Paris'

In [17]:
df.loc[2]['city']

'Paris'

In [23]:
df.columns

Index(['city', 'year', 'pop'], dtype='object')

## Adding new columns

New columns can be added to a `DataFrame` simply by assigning them by index (as you would for a Python `dict`) and can be deleted with the `del` keyword in the same way:

In [25]:
df['bool'] = True
df

      city  year    pop  bool
0    Paris  2001  2.148  True
1    Paris  2008  2.211  True
2    Paris  2009  2.234  True
3    Paris  2010  2.244  True
4   London  2001  7.322  True
5   London  2006  7.657  True
6   London  2011  8.174  True
7   London  2015  8.615  True
8     Rome  2001  2.547  True
9     Rome  2006  2.627  True
10    Rome  2009  2.734  True
11    Rome  2012  2.627  True

In [26]:
del df['bool']

In [27]:
df

      city  year    pop
0    Paris  2001  2.148
1    Paris  2008  2.211
2    Paris  2009  2.234
3    Paris  2010  2.244
4   London  2001  7.322
5   London  2006  7.657
6   London  2011  8.174
7   London  2015  8.615
8     Rome  2001  2.547
9     Rome  2006  2.627
10    Rome  2009  2.734
11    Rome  2012  2.627

## Filtering a dataframe

In [28]:
df.city == 'Paris'

0      True
1      True
2      True
3      True
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
Name: city, dtype: bool

This gives a `Series` which has `True` set where the city is Paris and `False` elsewhere.

We can use filtered `Series` like this to filter the `DataFrame` as a whole. `df.city == 'Paris'` has returned a `Series` containing booleans. Passing it back into `df` as an indexing operation will use it to filter based on the `'city'` column.

In [29]:
df[df.city == 'Paris']

    city  year    pop
0  Paris  2001  2.148
1  Paris  2008  2.211
2  Paris  2009  2.234
3  Paris  2010  2.244

same as

In [30]:
df.query("city == 'Paris'")

    city  year    pop
0  Paris  2001  2.148
1  Paris  2008  2.211
2  Paris  2009  2.234
3  Paris  2010  2.244

You can then carry on and grab another column after that filter:

In [24]:
df[df.city == 'Paris'].year

0    2001
1    2008
2    2009
3    2010
Name: year, dtype: int64

## Reading from file

One of the msot common situations is that you have some data file containing the data you want to read. Perhaps this is data you've produced yourself or maybe it's from a collegue. In an ideal world the file will be perfectly formatted and will be trivial to import into pandas but since this is so often not the case, it provides a number of features to make your ife easier.

Full information on reading and writing is available in the pandas manual on [IO tools](http://pandas.pydata.org/pandas-docs/stable/io.html) but first it's worth noting the common formats that pandas can work with:
- Comma separated tables (or tab-separated or space-separated etc.)
- Excel spreadsheets
- HDF5 files
- SQL databases

For this course we will focus on plain-text CSV files as they are perhaps the most common format. Imagine we have a CSV file like (you can download this file from [city_pop.csv](https://raw.githubusercontent.com/milliams/data_analysis_python/master/city_pop.csv)):

We can use the pandas function `read_csv()` to read the file and convert it to a `DataFrame`. Full documentation for this function can be found in [the manual](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html) or, as with any Python object, directly in the notebook by putting a `?` after the name:

help(pd.read_csv)

In [31]:
pd.read_csv('city_pop.csv')

                          This is an example CSV file
0   The text at the top here is not part of the da...
1   to describe the file. You'll see this quite of...
2                     A -1 signifies a missing value.
3                              year;London;Paris;Rome
4                              2001;7.322;2.148;2.547
5                                   2006;7.652;;2.627
6                                      2008;-1;2.211;
7                                 2009;-1;2.234;2.734
8                                        2011;8.174;;
9                                 2012;-1;2.244;2.627
10                                       2015;8.615;;

We can see that by default it's done a fairly bad job of parsing the file (this is mostly because I;ve construsted the `city_pop.csv` file to be as obtuse as possible). It's making a lot of assumptions about the structure of the file but in general it's taking quite a na√Øve approach.

The first this we notice is that it's treating the text at the top of the file as though it's data. Checking [the documentation](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html) we see that the simplest way to solve this is to use the `skiprows` argument to the function to which we give an integer giving the number of rows to skip:

In [32]:
pd.read_csv(
    'city_pop.csv',
    skiprows=5,
)

   year;London;Paris;Rome
0  2001;7.322;2.148;2.547
1       2006;7.652;;2.627
2          2008;-1;2.211;
3     2009;-1;2.234;2.734
4            2011;8.174;;
5     2012;-1;2.244;2.627
6            2015;8.615;;

The next most obvious problem is that it is not separating the columns at all. This is controlled by the `sep` argument which is set to `','` by default (hence *comma* separated values). We can simply set it to the appropriate semi-colon:

In [33]:
pd.read_csv('city_pop.csv', skiprows=5, sep=';')

   year  London  Paris   Rome
0  2001   7.322  2.148  2.547
1  2006   7.652    NaN  2.627
2  2008  -1.000  2.211    NaN
3  2009  -1.000  2.234  2.734
4  2011   8.174    NaN    NaN
5  2012  -1.000  2.244  2.627
6  2015   8.615    NaN    NaN

Reading the descriptive header of our data file we see that a value of `-1` signifies a missing reading so we should mark those too. This can be done after the fact but it is simplest to do it at import-time using the `na_values` argument:

In [28]:
df = pd.read_csv(
    'city_pop.csv',
    skiprows=5,
    sep=';',
    na_values='-1'
)

In [29]:
new_df = df.dropna()

new_df

   year  London  Paris   Rome
0  2001   7.322  2.148  2.547

In [30]:
df.fillna(0, inplace = True)

In [31]:
df

   year  London  Paris   Rome
0  2001   7.322  2.148  2.547
1  2006   7.652  0.000  2.627
2  2008   0.000  2.211  0.000
3  2009   0.000  2.234  2.734
4  2011   8.174  0.000  0.000
5  2012   0.000  2.244  2.627
6  2015   8.615  0.000  0.000